---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.InvalidNumberOfMechanicalEquipmentOnDuty
source: html/e30ce807-0690-2445-1a4c-cb7915c1b537.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.InvalidNumberOfMechanicalEquipmentOnDuty Property

The number of on duty equipment must be less than or equal to the number of available equipments.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidNumberOfMechanicalEquipmentOnDuty { get; }
```